let handler = async m => m.reply(`
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆
≡★☆🅟🅡🅘🅝🅒🅔 🅣🅗🅔 🅞🅦🅝🅔🅡☆★≡

★𝚂𝚄𝙿𝙿𝙾®𝚃 𝙶𝚁𝙾𝚄𝙿 𝙻𝙸𝙽𝙺★
─────────────
▢ ★☆☆🛡️ᑭᖇIᑎᑕᕮ ᗷOT ᗰᗪ🛡️☆☆★

🅛🅘🅝🅚: https://chat.whatsapp.com/GWJkAJSgbv27sGOMLAzMDS

★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆
 
★   ☆   ★   ☆   ★   ☆   ★   ☆
┊   ┊　　┊　　┊　　┊
┊   ┊　　┊　　┊　　★
┊   ┊　　┊　　☆
┊   ┊　　★
┊   ☆
★  wa.me/+923042205427  ★
★☆🅞🅦🅝🅔🅡 🅝🅤🅜🅑🅔🅡☆★
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
`.trim())
handler.help = ['gpprince']
handler.tags = ['main']
handler.command = ['groups', 'groupprince', 'gugp', 'ggp', 'support'] 

export default handler
